PeterSommerlad/ArduinoCore-avr/variants/standard/pins_arduino.h
//*************** try inline digitalWrite/Read and see what code is generated....
struct port_bit {
	PortType port;
	uint8_t bit;
};
constexpr inline
port_bit digital_pin_to_port_bit(uint8_t const pin) noexcept {
	return {digital_pin_to_Port_PS(pin),bitmask::digital_pin_to_BitMask_PS(pin)};
}
//struct SafeStatusRegisterAndClearInterrupt{
//	uint8_t oldSREG;
//	SafeStatusRegisterAndClearInterrupt()
//	:oldSREG{SREG} {
//		cli();
//	}
//	~SafeStatusRegisterAndClearInterrupt(){
//		SREG = oldSREG;
//	}
//};
#include <avr/io.h>

#ifndef cbi
#define cbi(sfr, bit) (_SFR_BYTE(sfr) &= ~_BV(bit))
#define CBI_SET
#endif
#ifndef sbi
#define sbi(sfr, bit) (_SFR_BYTE(sfr) |= _BV(bit))
#define SBI_SET
#endif

struct timer_info {
	volatile uint8_t * tccr;
	volatile void * ocr; // oh shit, 16 or 8 bit pointer.... need to put more smartness here
	uint8_t          combit;
	bool	is16bit;
	void setValue(int val) const {
		if (is16bit)
			*reinterpret_cast<volatile uint16_t *>(ocr) = val;
		else
			*reinterpret_cast<volatile uint8_t *>(ocr) = val;
	}
	constexpr static timer_info make(volatile uint8_t * tccr_, volatile uint8_t *ocr_, uint8_t combit_){
		return timer_info{tccr_,ocr_,combit_,false};
	}
	constexpr static timer_info make(volatile uint8_t * tccr_, volatile uint16_t *ocr_, uint8_t combit_){
			return timer_info{tccr_,ocr_,combit_,true};
	}
};
struct timer_OCR_info {
	volatile void * const ocr; // oh shit, 16 or 8 bit pointer.... need to put more smartness here
	bool	const is16bit;
	void setValue(int val) const {
		if (is16bit)
			*reinterpret_cast<volatile uint16_t *>(ocr) = val;
		else
			*reinterpret_cast<volatile uint8_t *>(ocr) = val;
	}
	constexpr static timer_OCR_info make(volatile uint8_t *ocr_){
		return timer_OCR_info{ocr_,false};
	}
	constexpr static timer_OCR_info make(volatile uint16_t *ocr_){
			return timer_OCR_info{ocr_,true};
	}
};
constexpr
inline volatile uint8_t * digital_pin_to_timer_tccr(uint8_t const pin) noexcept {
	// values taken from wiring_analog.c
#if defined(__AVR_ATmega8__)
	if (pin == PinType::D11)
		return  &TCCR2;//TIMER2;//,		/* 11 */ -> 6 // OCR2 always 8bit
#else
	if (pin == PinType::D03) //        /* 3 */ -> 8
		return &TCCR2A;//TIMER2B; // OCR2B 8 or 16
	if (pin ==  PinType::D05)
		return &TCCR0A;//TIMER0B;//,		/* 5 */ -> 2 // OCR0B 8bit except some tiny iotn[4,5,9,10].h
	if (pin ==  PinType::D06){
#if defined(TCCR0) && defined(COM00) && !defined(__AVR_ATmega8__)
		return &TCCR0;//TIMER0A;//,		/* 6 */ -> 1 // OCR0 8bit
#elif defined(TCCR0A) && defined(COM0A1)
		return &TCCR0A;//TIMER0A;//,		/* 6 */ -> 1 // OCR0A 8bit except some tiny like OCR0B
#endif
	}
	if (pin ==  PinType::D11)
		return &TCCR2A;//TIMER2A;//,		/* 11 */ -> 7 // OCR2A 8bit, except iotn441 iotn841
#endif
	if (pin ==  PinType::D09)
		return  &TCCR1A;//TIMER1A;//,		/* 9 */ -> 3 // mostly 16 bit, except some mega hv, some tiny
	if (pin ==  PinType::D10)
		return  &TCCR1A;//TIMER1B;//,		/* 10 */ -> 4 // mostly 16 bit, except same as OCR1B
	return nullptr; // COMxxx bits are never 0
}

constexpr inline uint8_t digital_pin_to_timer_combits(uint8_t const pin) noexcept {
	// values taken from wiring_analog.c
#if defined(__AVR_ATmega8__)
	if (pin == PinType::D11)
		return  COM21 ;//TIMER2;//,		/* 11 */ -> 6 // OCR2 always 8bit
#else
	if (pin == PinType::D03) //        /* 3 */ -> 8
		return COM2B1 ;//TIMER2B; // OCR2B 8 or 16
	if (pin ==  PinType::D05)
		return COM0B1 ;//TIMER0B;//,		/* 5 */ -> 2 // OCR0B 8bit except some tiny iotn[4,5,9,10].h
	if (pin ==  PinType::D06){
#if defined(TCCR0) && defined(COM00) && !defined(__AVR_ATmega8__)
		return COM00 ;//TIMER0A;//,		/* 6 */ -> 1 // OCR0 8bit
#elif defined(TCCR0A) && defined(COM0A1)
		return COM0A1 ;//TIMER0A;//,		/* 6 */ -> 1 // OCR0A 8bit except some tiny like OCR0B
#endif
	}
	if (pin ==  PinType::D11)
		return COM2A1 ;//TIMER2A;//,		/* 11 */ -> 7 // OCR2A 8bit, except iotn441 iotn841
#endif
	if (pin ==  PinType::D09)
		return  COM1A1 ;//TIMER1A;//,		/* 9 */ -> 3 // mostly 16 bit, except some mega hv, some tiny
	if (pin ==  PinType::D10)
		return  COM1B1 ;//TIMER1B;//,		/* 10 */ -> 4 // mostly 16 bit, except same as OCR1B
	return 0; // COMxxx bits are never 0
}

inline void analog_pin_to_timer_assign(uint8_t const pin, int const val) noexcept {
	// values taken from wiring_analog.c
#if defined(__AVR_ATmega8__)
	if (pin == PinType::D11)
		 OCR2 = val;//TIMER2;//,		/* 11 */ -> 6 // OCR2 always 8bit
	else
#else
	if (pin == PinType::D03) //        /* 3 */ -> 8
		OCR2B = val;//TIMER2B; // OCR2B 8 or 16
	else if (pin ==  PinType::D05)
		OCR0B = val;//TIMER0B;//,		/* 5 */ -> 2 // OCR0B 8bit except some tiny iotn[4,5,9,10].h
	else if (pin ==  PinType::D06){
#if defined(TCCR0) && defined(COM00) && !defined(__AVR_ATmega8__)
		OCR0 = val;//TIMER0A;//,		/* 6 */ -> 1 // OCR0 8bit
#elif defined(TCCR0A) && defined(COM0A1)
		OCR0A=val;//TIMER0A;//,		/* 6 */ -> 1 // OCR0A 8bit except some tiny like OCR0B
#endif
	}
	else if (pin ==  PinType::D11)
		OCR2A = val;//TIMER2A;//,		/* 11 */ -> 7 // OCR2A 8bit, except iotn441 iotn841
#endif
	else if (pin ==  PinType::D09)
		OCR1A = val;//TIMER1A;//,		/* 9 */ -> 3 // mostly 16 bit, except some mega hv, some tiny
	else if (pin ==  PinType::D10)
		OCR1B = val;//TIMER1B;//,		/* 10 */ -> 4 // mostly 16 bit, except same as OCR1B
}

constexpr inline timer_info digital_pin_to_timer_info(uint8_t const pin) noexcept {
	// values taken from wiring_analog.c
#if defined(__AVR_ATmega8__)
	if (pin == PinType::D11)
		return { &TCCR2,  &OCR2,  COM21 };//TIMER2;//,		/* 11 */ -> 6 // OCR2 always 8bit
#else
	if (pin == PinType::D03) //        /* 3 */ -> 8
		return timer_info::make( &TCCR2A, &OCR2B, COM2B1 );//TIMER2B; // OCR2B 8 or 16
	if (pin ==  PinType::D05)
		return timer_info::make( &TCCR0A, &OCR0B, COM0B1 );//TIMER0B;//,		/* 5 */ -> 2 // OCR0B 8bit except some tiny iotn[4,5,9,10].h
	if (pin ==  PinType::D06){
#if defined(TCCR0) && defined(COM00) && !defined(__AVR_ATmega8__)
		return timer_info::make( &TCCR0,  &OCR0,  COM00  );//TIMER0A;//,		/* 6 */ -> 1 // OCR0 8bit
#elif defined(TCCR0A) && defined(COM0A1)
		return timer_info::make( &TCCR0A,  &OCR0A,  COM0A1  );//TIMER0A;//,		/* 6 */ -> 1 // OCR0A 8bit except some tiny like OCR0B
#endif
	}
	if (pin ==  PinType::D11)
		return timer_info::make( &TCCR2A, &OCR2A, COM2A1 );//TIMER2A;//,		/* 11 */ -> 7 // OCR2A 8bit, except iotn441 iotn841
#endif
	if (pin ==  PinType::D09)
		return timer_info::make( &TCCR1A, &OCR1A, COM1A1 );//TIMER1A;//,		/* 9 */ -> 3 // mostly 16 bit, except some mega hv, some tiny
	if (pin ==  PinType::D10)
		return timer_info::make( &TCCR1A, &OCR1B, COM1B1 );//TIMER1B;//,		/* 10 */ -> 4 // mostly 16 bit, except same as OCR1B
	return timer_info{nullptr,nullptr,0,false}; // COMxxx bits are never 0
}
template<PinType pin>
inline
void turnOffPWMPS()
{
	auto const ti_tccr = digital_pin_to_timer_tccr(pin);
	auto const ti_combit = digital_pin_to_timer_combits(pin);
	cbi(*ti_tccr,ti_combit);
}
inline
void turnOffPWMPS(PinType pin)
{
	auto const ti_tccr = digital_pin_to_timer_tccr(pin);
	auto const ti_combit = digital_pin_to_timer_combits(pin);
	cbi(*ti_tccr,ti_combit);
}

// no need for further constant folding? try it anyway
template <uint8_t pin,uint8_t  mode>
inline
void pinMode()
{
	constexpr uint8_t const bit = digitalPinToBitMask(pin);
	constexpr PortType const port = digitalPinToPort(pin);


	if constexpr (port == NO_PORT) return;

	 volatile uint8_t * const reg = portModeRegister(port);
	 volatile uint8_t * const out = portOutputRegister(port);
	if constexpr (mode == INPUT) {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg &= ~bit;
		*out &= ~bit;
	} else if constexpr (mode == INPUT_PULLUP) {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg &= ~bit;
		*out |= bit;
	} else {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg |= bit;
	}
}

template <uint8_t pin>
inline
void pinMode(uint8_t const mode)
{
	constexpr uint8_t const bit = digitalPinToBitMask(pin);
	constexpr PortType const port = digitalPinToPort(pin);


	if constexpr (port == NO_PORT) return;

	 volatile uint8_t *  reg = portModeRegister(port);
	 volatile uint8_t *  out = portOutputRegister(port);
	if (mode == INPUT) {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg &= ~bit;
		*out &= ~bit;
	} else if (mode == INPUT_PULLUP) {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg &= ~bit;
		*out |= bit;
	} else {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg |= bit;
	}
}

inline
void pinMode(uint8_t const pin, uint8_t const mode)
{
	uint8_t const bit = digitalPinToBitMask(pin);
	PortType const port = digitalPinToPort(pin);


	if (port == NO_PORT) return;

	volatile uint8_t * const reg = portModeRegister(port);
	volatile uint8_t * const out = portOutputRegister(port);
	if (mode == INPUT) {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg &= ~bit;
		*out &= ~bit;
	} else if (mode == INPUT_PULLUP) {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg &= ~bit;
		*out |= bit;
	} else {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg |= bit;
	}
}
inline
void digitalWrite(uint8_t const pin, uint8_t const val)
{
	auto const timer = digitalPinToTimer(pin);
	auto const port = digital_pin_to_Port_PS(pin);
	auto const bit = bitmask::digital_pin_to_BitMask_PS(pin);

