PeterSommerlad/ArduinoCore-avr/variants/standard/pins_arduino.h
	if (port == NO_PORT) return; // should use the enum...

	// If the pin that support PWM output, we need to turn it off
	// before doing a digital write.
	if (timer != NOT_ON_TIMER) turnOffPWMPS(PinType(pin));

	volatile uint8_t * const out = portOutputRegister(port);

	SafeStatusRegisterAndClearInterrupt safe;
	if (val == LOW) {
		*out &= ~bit;
	} else {
		*out |= bit;
	}
}

template<uint8_t L_H>
inline
void digitalWrite_LH(uint8_t const pin)
{
	auto const timer = digitalPinToTimer(pin);
	auto const port = digital_pin_to_Port_PS(pin);
	auto const bit = bitmask::digital_pin_to_BitMask_PS(pin);

	if (port == NO_PORT) return; // should use the enum...

	// If the pin that support PWM output, we need to turn it off
	// before doing a digital write.
	if (timer != NOT_ON_TIMER) turnOffPWMPS(PinType(pin));

	volatile uint8_t * const out = portOutputRegister(port);

	SafeStatusRegisterAndClearInterrupt safe;
	if constexpr (L_H == LOW) {
		*out &= ~bit;
	} else {
		*out |= bit;
	}
}



template <uint8_t pin>
inline
void digitalWrite(uint8_t const val)
{
	constexpr uint8_t const timer = digitalPinToTimer(pin);
	constexpr auto port = digital_pin_to_Port_PS(pin);
	constexpr auto bit = bitmask::digital_pin_to_BitMask_PS(pin);

	if constexpr (port == NO_PORT) return; // should use the enum...

	// If the pin that support PWM output, we need to turn it off
	// before doing a digital write.
	if constexpr (timer != NOT_ON_TIMER) turnOffPWMPS<PinType(pin)>();

	volatile uint8_t * const out = portOutputRegister(port);

	SafeStatusRegisterAndClearInterrupt safe;
	if (val == LOW) {
		*out &= ~bit;
	} else {
		*out |= bit;
	}
}
template <uint8_t pin, uint8_t val>
void digitalWrite()
{
	constexpr auto const timer = digitalPinToTimer(pin);
	constexpr auto port = digital_pin_to_Port_PS(pin);
	constexpr auto bit = bitmask::digital_pin_to_BitMask_PS(pin);

	if constexpr (port == NO_PORT) return; // should use the enum...

	// If the pin that support PWM output, we need to turn it off
	// before doing a digital write.
	if constexpr (timer != NOT_ON_TIMER) turnOffPWMPS<PinType(pin)>();

	volatile uint8_t * const out = portOutputRegister(port);

	SafeStatusRegisterAndClearInterrupt safe;
	if constexpr (val == LOW) {
		*out &= ~bit;
	} else {
		*out |= bit;
	}
}
template <uint8_t pin>
inline
int digitalRead()
{
	constexpr auto timer = digitalPinToTimer(pin);
	constexpr uint8_t bit = digitalPinToBitMask(pin);
	constexpr PortType port = digitalPinToPort(pin);

	if constexpr (port == NO_PORT) return LOW;

	// If the pin that support PWM output, we need to turn it off
	// before getting a digital reading.
	if constexpr (timer != NOT_ON_TIMER) turnOffPWMPS<PinType(pin)>();

	if (*portInputRegister(port) & bit) return HIGH;
	return LOW;
}
inline
int digitalRead(uint8_t const pin)
{
	auto const timer = digitalPinToTimer(pin);
	uint8_t const bit = digitalPinToBitMask(pin);
	PortType const port = digitalPinToPort(pin);

	if (port == NO_PORT) return LOW;

	// If the pin that support PWM output, we need to turn it off
	// before getting a digital reading.
	if (timer != NOT_ON_TIMER) turnOffPWMPS(PinType(pin));

	if (*portInputRegister(port) & bit) return HIGH;
	return LOW;
}

namespace analog{
inline uint8_t analog_reference = DEFAULT;

inline
void analogReference(uint8_t mode)
{
	// can't actually set the register here because the default setting
	// will connect AVCC and the AREF pin, which would cause a short if
	// there's something connected to AREF.
	analog_reference = mode;
}
}
inline
int analogRead(uint8_t pin)
{
	using ::analog::analog_reference;

#if defined(analogPinToChannel)
#if defined(__AVR_ATmega32U4__)
	if (pin >= 18) pin -= 18; // allow for channel or pin numbers
#endif
	pin = analogPinToChannel(pin);
#elif defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
	if (pin >= 54) pin -= 54; // allow for channel or pin numbers
#elif defined(__AVR_ATmega32U4__)
	if (pin >= 18) pin -= 18; // allow for channel or pin numbers
#elif defined(__AVR_ATmega1284__) || defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega644__) || defined(__AVR_ATmega644A__) || defined(__AVR_ATmega644P__) || defined(__AVR_ATmega644PA__)
	if (pin >= 24) pin -= 24; // allow for channel or pin numbers
#else
	if (pin >= 14) pin -= 14; // allow for channel or pin numbers
#endif

#if defined(ADCSRB) && defined(MUX5)
	// the MUX5 bit of ADCSRB selects whether we're reading from channels
	// 0 to 7 (MUX5 low) or 8 to 15 (MUX5 high).
	ADCSRB = (ADCSRB & ~(1 << MUX5)) | (((pin >> 3) & 0x01) << MUX5);
#endif

	// set the analog reference (high two bits of ADMUX) and select the
	// channel (low 4 bits).  this also sets ADLAR (left-adjust result)
	// to 0 (the default).
#if defined(ADMUX)
#if defined(__AVR_ATtiny25__) || defined(__AVR_ATtiny45__) || defined(__AVR_ATtiny85__)
	ADMUX = (analog_reference << 4) | (pin & 0x07);
#else
	ADMUX = (analog_reference << 6) | (pin & 0x07);
#endif
#endif

	// without a delay, we seem to read from the wrong channel
	//delay(1);

#if defined(ADCSRA) && defined(ADCL)
	// start the conversion
	sbi(ADCSRA, ADSC);

	// ADSC is cleared when the conversion finishes
	while (bit_is_set(ADCSRA, ADSC));

	// we have to read ADCL first; doing so locks both ADCL
	// and ADCH until ADCH is read.  reading ADCL second would
	// cause the results of each conversion to be discarded,
	// as ADCL and ADCH would be locked when it completed.
	uint8_t const low  = ADCL;
	uint8_t const high = ADCH;
	return (high << 8) | low;
#else
	// we dont have an ADC,
	return 0;
#endif
}



template <uint8_t const pin>
inline
void analogWrite( int const val)
{
	// We need to make sure the PWM output is enabled for those pins
	// that support it, as we turn it off when digitally reading or
	// writing with them.  Also, make sure the pin is in output mode
	// for consistenty with Wiring, which doesn't require a pinMode
	// call for the analog output pins.
	pinMode<pin, OUTPUT>();
	if (val == 0)
	{
		digitalWrite<pin,LOW>();
	}
	else if (val == 255)
	{
		digitalWrite<pin,HIGH>();
	}
	else
	{
		volatile uint8_t* const  ti_tccr = digital_pin_to_timer_tccr(pin);
		constexpr auto const ti_combit = digital_pin_to_timer_combits(pin);
		if constexpr (ti_combit){
			sbi(*ti_tccr,ti_combit);
			analog_pin_to_timer_assign(pin, val); // set pwm duty
		} else { // not on a timer
			if (val < 128) {
				digitalWrite<pin,LOW>();
			} else {
				digitalWrite<pin,HIGH>();
			}

