PeterSommerlad/ArduinoCore-avr/variants/standard/pins_arduino.h
		}
	}
}

inline
void analogWrite(uint8_t const pin, int const val)
{
	// We need to make sure the PWM output is enabled for those pins
	// that support it, as we turn it off when digitally reading or
	// writing with them.  Also, make sure the pin is in output mode
	// for consistenty with Wiring, which doesn't require a pinMode
	// call for the analog output pins.
	pinMode(pin, OUTPUT);
	if (val == 0)
	{
		digitalWrite_LH<LOW>(pin);
	}
	else if (val == 255)
	{
		digitalWrite_LH<HIGH>(pin);
	}
	else
	{
		auto const ti_tccr = digital_pin_to_timer_tccr(pin);
		auto const ti_combit = digital_pin_to_timer_combits(pin);
		if (ti_combit){
			sbi(*ti_tccr,ti_combit);
			analog_pin_to_timer_assign(pin, val); // set pwm duty
		} else { // not on a timer
			if (val < 128) {
				digitalWrite_LH<LOW>(pin);
			} else {
				digitalWrite_LH<HIGH>(pin);
			}

		}
	}
}
#ifdef CBI_SET
#undef CBI_SET
#undef cbi
#endif
#ifdef SBI_SET
#undef SBI_SET
#undef sbi
#endif


#endif

// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_MONITOR   Serial
#define SERIAL_PORT_HARDWARE  Serial

#endif
